"""
🧪 Задание к уроку 1:
Создай файл lesson_1.py, в котором:

создаются 3 переменные: твоё имя, возраст и любимый язык программирования;

с помощью print() они выводятся в виде:

markdown
Копировать
Редактировать
Привет, меня зовут ___!
Мне ___ лет.
Я люблю язык ___.
добавь минимум один комментарий;

используй f-строку при выводе текста.
"""


my_name = "Илья"
my_age = 28
my_language = "Python"

# Вывод информации в консоль
print(
    f"Привет, меня зовут {my_name}!\n"
    f"Мне {my_age} лет.\n"
    f"Я люблю язык {my_language}"
)